In [40]:
import pandas as pd

#### Series

In [4]:
s = pd.Series([89,45,71,25,63,91])

In [5]:
s

0    89
1    45
2    71
3    25
4    63
5    91
dtype: int64

In [6]:
type(s)

pandas.core.series.Series

In [7]:
s[3]

25

In [8]:
s = pd.Series([89,45,71,25,63,91], 
             index=range(100,106))

In [9]:
s

100    89
101    45
102    71
103    25
104    63
105    91
dtype: int64

In [10]:
s[104]

63

In [11]:
s.size

6

In [12]:
s.dtype

dtype('int64')

In [13]:
s.ndim

1

In [14]:
s.shape

(6,)

In [15]:
s.values

array([89, 45, 71, 25, 63, 91])

#### DataFrame

In [18]:
roll = pd.Series(range(1,6))
name = pd.Series(['Raj','Anita','Akash',
                  'Arjun','Priya'])
marks = pd.Series([56.78, 82.34, 76.45, 
                   64.35, 61.06])

In [19]:
df = pd.DataFrame({
    'Roll': roll,
    'Name': name,
    'Marks': marks
})

In [20]:
df

   Roll   Name  Marks
0     1    Raj  56.78
1     2  Anita  82.34
2     3  Akash  76.45
3     4  Arjun  64.35
4     5  Priya  61.06

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df.shape

(5, 3)

In [23]:
df.ndim

2

In [24]:
df.size

15

In [25]:
# Dataset Location: https://mitu.co.in/dataset
# Download all the datasets whose name starts
# with student* and store in current working
# directory

In [26]:
import os
os.getcwd()

'/home/mitu'

#### Data import

In [28]:
df = pd.read_csv('student.csv')

In [29]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [30]:
df1 = pd.read_csv('student1.csv')

In [31]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [34]:
headers = ['A','B','C','D','E']
df1 = pd.read_csv('student1.csv', names=headers)

In [35]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [38]:
df3 = pd.read_csv('student3.tsv', sep='\t')

In [39]:
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [41]:
df2 = pd.read_csv('https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv')

In [42]:
df2

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [43]:
df.shape

(10, 5)

In [44]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [45]:
df.size

50

In [46]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [47]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [48]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [49]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [50]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21

#### Index based slicing

In [52]:
x = df.iloc[3:9,1:4]

In [53]:
x

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75

In [54]:
df.iloc[3:,1:4]

      name class  marks
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33
8     amol    TE  56.75
9    anmol    BE  78.66

In [55]:
df.iloc[:8,1:4]

      name class  marks
0     anil    TE  56.77
1     amit    TE  59.77
2   aniket    BE  76.88
3  ajinkya    TE  69.66
4     asha    TE  63.28
5   ayesha    BE  49.55
6     amar    BE  65.34
7    amita    BE  68.33

In [56]:
df.iloc[3:9,1:]

      name class  marks  age
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20

In [57]:
df.iloc[3:9,:4]

   roll     name class  marks
3     4  ajinkya    TE  69.66
4     5     asha    TE  63.28
5     6   ayesha    BE  49.55
6     7     amar    BE  65.34
7     8    amita    BE  68.33
8     9     amol    TE  56.75

In [58]:
df.iloc[:,:]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [59]:
df.iloc[[3,8,6,2],:]

   roll     name class  marks  age
3     4  ajinkya    TE  69.66   20
8     9     amol    TE  56.75   20
6     7     amar    BE  65.34   19
2     3   aniket    BE  76.88   19

In [60]:
df.iloc[[3,8,6,2],[1,4]]

      name  age
3  ajinkya   20
8     amol   20
6     amar   19
2   aniket   19

In [62]:
df.iloc[4,:]

roll         5
name      asha
class       TE
marks    63.28
age         20
Name: 4, dtype: object

In [63]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [64]:
df.iloc[3:9,1]

3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
Name: name, dtype: object

#### Label based slicing

In [67]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [68]:
df.loc[:,['name','marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [69]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [70]:
df[['name','marks','class']]

      name  marks class
0     anil  56.77    TE
1     amit  59.77    TE
2   aniket  76.88    BE
3  ajinkya  69.66    TE
4     asha  63.28    TE
5   ayesha  49.55    BE
6     amar  65.34    BE
7    amita  68.33    BE
8     amol  56.75    TE
9    anmol  78.66    BE

In [71]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [72]:
df.drop(5)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [73]:
df.drop([2,5,9])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20

In [74]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [76]:
df.drop('class', axis = 1)

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

In [77]:
df.drop(['class','age'], axis = 1)

   roll     name  marks
0     1     anil  56.77
1     2     amit  59.77
2     3   aniket  76.88
3     4  ajinkya  69.66
4     5     asha  63.28
5     6   ayesha  49.55
6     7     amar  65.34
7     8    amita  68.33
8     9     amol  56.75
9    10    anmol  78.66

In [78]:
df.drop('class', axis = 1, inplace=True)

In [79]:
df

   roll     name  marks  age
0     1     anil  56.77   22
1     2     amit  59.77   21
2     3   aniket  76.88   19
3     4  ajinkya  69.66   20
4     5     asha  63.28   20
5     6   ayesha  49.55   20
6     7     amar  65.34   19
7     8    amita  68.33   23
8     9     amol  56.75   20
9    10    anmol  78.66   21

#### Series Functions

In [81]:
df['marks'].mean()

64.499

In [82]:
df['marks'].median()

64.31

In [83]:
df['marks'].sum()

644.9899999999999

In [84]:
df['marks'].min()

49.55

In [85]:
df['marks'].max()

78.66

In [86]:
df['name'].max()

'ayesha'

In [87]:
df['name'].min()

'ajinkya'

In [88]:
df['name'].sum()

'anilamitaniketajinkyaashaayeshaamaramitaamolanmol'

In [89]:
df['name'].count()

10

In [90]:
df.sum()

roll                                                    55
name     anilamitaniketajinkyaashaayeshaamaramitaamolanmol
marks                                               644.99
age                                                    205
dtype: object

In [92]:
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [94]:
df.max()

roll         10
name     ayesha
marks     78.66
age          23
dtype: object

In [95]:
df = pd.read_csv('student.csv')

In [96]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [97]:
df['class']

0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
6    BE
7    BE
8    TE
9    BE
Name: class, dtype: object

In [98]:
df['class'].value_counts()

class
TE    5
BE    5
Name: count, dtype: int64

In [99]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [100]:
df['class'].mode()

0    BE
1    TE
Name: class, dtype: object

In [101]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [103]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [104]:
df['roll'] + 100

0    101
1    102
2    103
3    104
4    105
5    106
6    107
7    108
8    109
9    110
Name: roll, dtype: int64

#### Adding custom columns

In [106]:
df['marks'] = df['marks'] + 0.25

In [107]:
df

   roll     name class  marks  age
0     1     anil    TE  57.02   22
1     2     amit    TE  60.02   21
2     3   aniket    BE  77.13   19
3     4  ajinkya    TE  69.91   20
4     5     asha    TE  63.53   20
5     6   ayesha    BE  49.80   20
6     7     amar    BE  65.59   19
7     8    amita    BE  68.58   23
8     9     amol    TE  57.00   20
9    10    anmol    BE  78.91   21

In [108]:
df['cgpa'] = df['marks'] / 10 + 1.024

In [109]:
df

   roll     name class  marks  age   cgpa
0     1     anil    TE  57.02   22  6.726
1     2     amit    TE  60.02   21  7.026
2     3   aniket    BE  77.13   19  8.737
3     4  ajinkya    TE  69.91   20  8.015
4     5     asha    TE  63.53   20  7.377
5     6   ayesha    BE  49.80   20  6.004
6     7     amar    BE  65.59   19  7.583
7     8    amita    BE  68.58   23  7.882
8     9     amol    TE  57.00   20  6.724
9    10    anmol    BE  78.91   21  8.915

In [110]:
y = ['M','M','M','M','F','F','M','F','M','M']

In [111]:
df['gender'] = y

In [112]:
df

   roll     name class  marks  age   cgpa gender
0     1     anil    TE  57.02   22  6.726      M
1     2     amit    TE  60.02   21  7.026      M
2     3   aniket    BE  77.13   19  8.737      M
3     4  ajinkya    TE  69.91   20  8.015      M
4     5     asha    TE  63.53   20  7.377      F
5     6   ayesha    BE  49.80   20  6.004      F
6     7     amar    BE  65.59   19  7.583      M
7     8    amita    BE  68.58   23  7.882      F
8     9     amol    TE  57.00   20  6.724      M
9    10    anmol    BE  78.91   21  8.915      M